/* automatically generated by rust-bindgen 0.72.1 */

pub const TIMELIB_ZONETYPE_ID: u32 = 3;
pub const TIMELIB_NO_CLONE: u32 = 2;
pub type timelib_sll = ::std::os::raw::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ttinfo {
    _unused: [u8; 0],
}
pub type ttinfo = _ttinfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tlinfo {
    _unused: [u8; 0],
}
pub type tlinfo = _tlinfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _tlocinfo {
    pub country_code: [::std::os::raw::c_char; 3usize],
    pub latitude: f64,
    pub longitude: f64,
    pub comments: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _tlocinfo"][::std::mem::size_of::<_tlocinfo>() - 32usize];
    ["Alignment of _tlocinfo"][::std::mem::align_of::<_tlocinfo>() - 8usize];
    ["Offset of field: _tlocinfo::country_code"]
        [::std::mem::offset_of!(_tlocinfo, country_code) - 0usize];
    ["Offset of field: _tlocinfo::latitude"][::std::mem::offset_of!(_tlocinfo, latitude) - 8usize];
    ["Offset of field: _tlocinfo::longitude"]
        [::std::mem::offset_of!(_tlocinfo, longitude) - 16usize];
    ["Offset of field: _tlocinfo::comments"][::std::mem::offset_of!(_tlocinfo, comments) - 24usize];
};
pub type tlocinfo = _tlocinfo;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _timelib_posix_trans_info {
    pub type_: ::std::os::raw::c_int,
    pub __bindgen_anon_1: _timelib_posix_trans_info__bindgen_ty_1,
    pub hour: ::std::os::raw::c_int,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _timelib_posix_trans_info__bindgen_ty_1 {
    pub days: ::std::os::raw::c_int,
    pub mwd: _timelib_posix_trans_info__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _timelib_posix_trans_info__bindgen_ty_1__bindgen_ty_1 {
    pub month: ::std::os::raw::c_int,
    pub week: ::std::os::raw::c_int,
    pub dow: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _timelib_posix_trans_info__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<_timelib_posix_trans_info__bindgen_ty_1__bindgen_ty_1>() - 12usize];
    ["Alignment of _timelib_posix_trans_info__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<_timelib_posix_trans_info__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Offset of field: _timelib_posix_trans_info__bindgen_ty_1__bindgen_ty_1::month"][::std::mem::offset_of!(
        _timelib_posix_trans_info__bindgen_ty_1__bindgen_ty_1,
        month
    ) - 0usize];
    ["Offset of field: _timelib_posix_trans_info__bindgen_ty_1__bindgen_ty_1::week"][::std::mem::offset_of!(
        _timelib_posix_trans_info__bindgen_ty_1__bindgen_ty_1,
        week
    ) - 4usize];
    ["Offset of field: _timelib_posix_trans_info__bindgen_ty_1__bindgen_ty_1::dow"][::std::mem::offset_of!(
        _timelib_posix_trans_info__bindgen_ty_1__bindgen_ty_1,
        dow
    ) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _timelib_posix_trans_info__bindgen_ty_1"]
        [::std::mem::size_of::<_timelib_posix_trans_info__bindgen_ty_1>() - 12usize];
    ["Alignment of _timelib_posix_trans_info__bindgen_ty_1"]
        [::std::mem::align_of::<_timelib_posix_trans_info__bindgen_ty_1>() - 4usize];
    ["Offset of field: _timelib_posix_trans_info__bindgen_ty_1::days"]
        [::std::mem::offset_of!(_timelib_posix_trans_info__bindgen_ty_1, days) - 0usize];
    ["Offset of field: _timelib_posix_trans_info__bindgen_ty_1::mwd"]
        [::std::mem::offset_of!(_timelib_posix_trans_info__bindgen_ty_1, mwd) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _timelib_posix_trans_info"]
        [::std::mem::size_of::<_timelib_posix_trans_info>() - 20usize];
    ["Alignment of _timelib_posix_trans_info"]
        [::std::mem::align_of::<_timelib_posix_trans_info>() - 4usize];
    ["Offset of field: _timelib_posix_trans_info::type_"]
        [::std::mem::offset_of!(_timelib_posix_trans_info, type_) - 0usize];
    ["Offset of field: _timelib_posix_trans_info::hour"]
        [::std::mem::offset_of!(_timelib_posix_trans_info, hour) - 16usize];
};
pub type timelib_posix_trans_info = _timelib_posix_trans_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _timelib_posix_str {
    pub std: *mut ::std::os::raw::c_char,
    pub std_offset: timelib_sll,
    pub dst: *mut ::std::os::raw::c_char,
    pub dst_offset: timelib_sll,
    pub dst_begin: *mut timelib_posix_trans_info,
    pub dst_end: *mut timelib_posix_trans_info,
    pub type_index_std_type: ::std::os::raw::c_int,
    pub type_index_dst_type: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _timelib_posix_str"][::std::mem::size_of::<_timelib_posix_str>() - 56usize];
    ["Alignment of _timelib_posix_str"][::std::mem::align_of::<_timelib_posix_str>() - 8usize];
    ["Offset of field: _timelib_posix_str::std"]
        [::std::mem::offset_of!(_timelib_posix_str, std) - 0usize];
    ["Offset of field: _timelib_posix_str::std_offset"]
        [::std::mem::offset_of!(_timelib_posix_str, std_offset) - 8usize];
    ["Offset of field: _timelib_posix_str::dst"]
        [::std::mem::offset_of!(_timelib_posix_str, dst) - 16usize];
    ["Offset of field: _timelib_posix_str::dst_offset"]
        [::std::mem::offset_of!(_timelib_posix_str, dst_offset) - 24usize];
    ["Offset of field: _timelib_posix_str::dst_begin"]
        [::std::mem::offset_of!(_timelib_posix_str, dst_begin) - 32usize];
    ["Offset of field: _timelib_posix_str::dst_end"]
        [::std::mem::offset_of!(_timelib_posix_str, dst_end) - 40usize];
    ["Offset of field: _timelib_posix_str::type_index_std_type"]
        [::std::mem::offset_of!(_timelib_posix_str, type_index_std_type) - 48usize];
    ["Offset of field: _timelib_posix_str::type_index_dst_type"]
        [::std::mem::offset_of!(_timelib_posix_str, type_index_dst_type) - 52usize];
};
pub type timelib_posix_str = _timelib_posix_str;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _timelib_tzinfo {
    pub name: *mut ::std::os::raw::c_char,
    pub _bit32: _timelib_tzinfo__bindgen_ty_1,
    pub bit64: _timelib_tzinfo__bindgen_ty_2,
    pub trans: *mut i64,
    pub trans_idx: *mut ::std::os::raw::c_uchar,
    pub type_: *mut ttinfo,
    pub timezone_abbr: *mut ::std::os::raw::c_char,
    pub leap_times: *mut tlinfo,
    pub bc: ::std::os::raw::c_uchar,
    pub location: tlocinfo,
    pub posix_string: *mut ::std::os::raw::c_char,
    pub posix_info: *mut timelib_posix_str,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _timelib_tzinfo__bindgen_ty_1 {
    pub ttisgmtcnt: u32,
    pub ttisstdcnt: u32,
    pub leapcnt: u32,
    pub timecnt: u32,
    pub typecnt: u32,
    pub charcnt: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _timelib_tzinfo__bindgen_ty_1"]
        [::std::mem::size_of::<_timelib_tzinfo__bindgen_ty_1>() - 24usize];
    ["Alignment of _timelib_tzinfo__bindgen_ty_1"]
        [::std::mem::align_of::<_timelib_tzinfo__bindgen_ty_1>() - 4usize];
    ["Offset of field: _timelib_tzinfo__bindgen_ty_1::ttisgmtcnt"]
        [::std::mem::offset_of!(_timelib_tzinfo__bindgen_ty_1, ttisgmtcnt) - 0usize];
    ["Offset of field: _timelib_tzinfo__bindgen_ty_1::ttisstdcnt"]
        [::std::mem::offset_of!(_timelib_tzinfo__bindgen_ty_1, ttisstdcnt) - 4usize];
    ["Offset of field: _timelib_tzinfo__bindgen_ty_1::leapcnt"]
        [::std::mem::offset_of!(_timelib_tzinfo__bindgen_ty_1, leapcnt) - 8usize];
    ["Offset of field: _timelib_tzinfo__bindgen_ty_1::timecnt"]
        [::std::mem::offset_of!(_timelib_tzinfo__bindgen_ty_1, timecnt) - 12usize];
    ["Offset of field: _timelib_tzinfo__bindgen_ty_1::typecnt"]
        [::std::mem::offset_of!(_timelib_tzinfo__bindgen_ty_1, typecnt) - 16usize];
    ["Offset of field: _timelib_tzinfo__bindgen_ty_1::charcnt"]
        [::std::mem::offset_of!(_timelib_tzinfo__bindgen_ty_1, charcnt) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _timelib_tzinfo__bindgen_ty_2 {
    pub ttisgmtcnt: u64,
    pub ttisstdcnt: u64,
    pub leapcnt: u64,
    pub timecnt: u64,
    pub typecnt: u64,
    pub charcnt: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _timelib_tzinfo__bindgen_ty_2"]
        [::std::mem::size_of::<_timelib_tzinfo__bindgen_ty_2>() - 48usize];
    ["Alignment of _timelib_tzinfo__bindgen_ty_2"]
        [::std::mem::align_of::<_timelib_tzinfo__bindgen_ty_2>() - 8usize];
    ["Offset of field: _timelib_tzinfo__bindgen_ty_2::ttisgmtcnt"]
        [::std::mem::offset_of!(_timelib_tzinfo__bindgen_ty_2, ttisgmtcnt) - 0usize];
    ["Offset of field: _timelib_tzinfo__bindgen_ty_2::ttisstdcnt"]
        [::std::mem::offset_of!(_timelib_tzinfo__bindgen_ty_2, ttisstdcnt) - 8usize];
    ["Offset of field: _timelib_tzinfo__bindgen_ty_2::leapcnt"]
        [::std::mem::offset_of!(_timelib_tzinfo__bindgen_ty_2, leapcnt) - 16usize];
    ["Offset of field: _timelib_tzinfo__bindgen_ty_2::timecnt"]
        [::std::mem::offset_of!(_timelib_tzinfo__bindgen_ty_2, timecnt) - 24usize];
    ["Offset of field: _timelib_tzinfo__bindgen_ty_2::typecnt"]
        [::std::mem::offset_of!(_timelib_tzinfo__bindgen_ty_2, typecnt) - 32usize];
    ["Offset of field: _timelib_tzinfo__bindgen_ty_2::charcnt"]
        [::std::mem::offset_of!(_timelib_tzinfo__bindgen_ty_2, charcnt) - 40usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _timelib_tzinfo"][::std::mem::size_of::<_timelib_tzinfo>() - 176usize];
    ["Alignment of _timelib_tzinfo"][::std::mem::align_of::<_timelib_tzinfo>() - 8usize];
    ["Offset of field: _timelib_tzinfo::name"]
        [::std::mem::offset_of!(_timelib_tzinfo, name) - 0usize];
    ["Offset of field: _timelib_tzinfo::_bit32"]
        [::std::mem::offset_of!(_timelib_tzinfo, _bit32) - 8usize];
    ["Offset of field: _timelib_tzinfo::bit64"]
        [::std::mem::offset_of!(_timelib_tzinfo, bit64) - 32usize];
    ["Offset of field: _timelib_tzinfo::trans"]
        [::std::mem::offset_of!(_timelib_tzinfo, trans) - 80usize];
    ["Offset of field: _timelib_tzinfo::trans_idx"]
        [::std::mem::offset_of!(_timelib_tzinfo, trans_idx) - 88usize];
    ["Offset of field: _timelib_tzinfo::type_"]
        [::std::mem::offset_of!(_timelib_tzinfo, type_) - 96usize];
    ["Offset of field: _timelib_tzinfo::timezone_abbr"]
        [::std::mem::offset_of!(_timelib_tzinfo, timezone_abbr) - 104usize];
    ["Offset of field: _timelib_tzinfo::leap_times"]
        [::std::mem::offset_of!(_timelib_tzinfo, leap_times) - 112usize];
    ["Offset of field: _timelib_tzinfo::bc"]
        [::std::mem::offset_of!(_timelib_tzinfo, bc) - 120usize];
    ["Offset of field: _timelib_tzinfo::location"]
        [::std::mem::offset_of!(_timelib_tzinfo, location) - 128usize];
    ["Offset of field: _timelib_tzinfo::posix_string"]
        [::std::mem::offset_of!(_timelib_tzinfo, posix_string) - 160usize];
    ["Offset of field: _timelib_tzinfo::posix_info"]
        [::std::mem::offset_of!(_timelib_tzinfo, posix_info) - 168usize];
};
pub type timelib_tzinfo = _timelib_tzinfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _timelib_rel_time {
    pub y: timelib_sll,
    pub m: timelib_sll,
    pub d: timelib_sll,
    pub h: timelib_sll,
    pub i: timelib_sll,
    pub s: timelib_sll,
    pub us: timelib_sll,
    pub weekday: ::std::os::raw::c_int,
    pub weekday_behavior: ::std::os::raw::c_int,
    pub first_last_day_of: ::std::os::raw::c_int,
    pub invert: ::std::os::raw::c_int,
    pub days: timelib_sll,
    pub special: _timelib_rel_time__bindgen_ty_1,
    pub have_weekday_relative: ::std::os::raw::c_uint,
    pub have_special_relative: ::std::os::raw::c_uint,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _timelib_rel_time__bindgen_ty_1 {
    pub type_: ::std::os::raw::c_uint,
    pub amount: timelib_sll,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _timelib_rel_time__bindgen_ty_1"]
        [::std::mem::size_of::<_timelib_rel_time__bindgen_ty_1>() - 16usize];
    ["Alignment of _timelib_rel_time__bindgen_ty_1"]
        [::std::mem::align_of::<_timelib_rel_time__bindgen_ty_1>() - 8usize];
    ["Offset of field: _timelib_rel_time__bindgen_ty_1::type_"]
        [::std::mem::offset_of!(_timelib_rel_time__bindgen_ty_1, type_) - 0usize];
    ["Offset of field: _timelib_rel_time__bindgen_ty_1::amount"]
        [::std::mem::offset_of!(_timelib_rel_time__bindgen_ty_1, amount) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _timelib_rel_time"][::std::mem::size_of::<_timelib_rel_time>() - 104usize];
    ["Alignment of _timelib_rel_time"][::std::mem::align_of::<_timelib_rel_time>() - 8usize];
    ["Offset of field: _timelib_rel_time::y"]
        [::std::mem::offset_of!(_timelib_rel_time, y) - 0usize];
    ["Offset of field: _timelib_rel_time::m"]
        [::std::mem::offset_of!(_timelib_rel_time, m) - 8usize];
    ["Offset of field: _timelib_rel_time::d"]
        [::std::mem::offset_of!(_timelib_rel_time, d) - 16usize];
    ["Offset of field: _timelib_rel_time::h"]
        [::std::mem::offset_of!(_timelib_rel_time, h) - 24usize];
    ["Offset of field: _timelib_rel_time::i"]
        [::std::mem::offset_of!(_timelib_rel_time, i) - 32usize];
    ["Offset of field: _timelib_rel_time::s"]
        [::std::mem::offset_of!(_timelib_rel_time, s) - 40usize];
    ["Offset of field: _timelib_rel_time::us"]
        [::std::mem::offset_of!(_timelib_rel_time, us) - 48usize];
    ["Offset of field: _timelib_rel_time::weekday"]
        [::std::mem::offset_of!(_timelib_rel_time, weekday) - 56usize];
    ["Offset of field: _timelib_rel_time::weekday_behavior"]
        [::std::mem::offset_of!(_timelib_rel_time, weekday_behavior) - 60usize];
    ["Offset of field: _timelib_rel_time::first_last_day_of"]
        [::std::mem::offset_of!(_timelib_rel_time, first_last_day_of) - 64usize];
    ["Offset of field: _timelib_rel_time::invert"]
        [::std::mem::offset_of!(_timelib_rel_time, invert) - 68usize];
    ["Offset of field: _timelib_rel_time::days"]
        [::std::mem::offset_of!(_timelib_rel_time, days) - 72usize];
    ["Offset of field: _timelib_rel_time::special"]
        [::std::mem::offset_of!(_timelib_rel_time, special) - 80usize];
    ["Offset of field: _timelib_rel_time::have_weekday_relative"]
        [::std::mem::offset_of!(_timelib_rel_time, have_weekday_relative) - 96usize];
    ["Offset of field: _timelib_rel_time::have_special_relative"]
        [::std::mem::offset_of!(_timelib_rel_time, have_special_relative) - 100usize];
};
pub type timelib_rel_time = _timelib_rel_time;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _timelib_time {
    pub y: timelib_sll,
    pub m: timelib_sll,
    pub d: timelib_sll,
    pub h: timelib_sll,
    pub i: timelib_sll,
    pub s: timelib_sll,
    pub us: timelib_sll,
    pub z: ::std::os::raw::c_int,
    pub tz_abbr: *mut ::std::os::raw::c_char,
    pub tz_info: *mut timelib_tzinfo,
    pub dst: ::std::os::raw::c_int,
    pub relative: timelib_rel_time,
    pub sse: timelib_sll,
    pub have_time: ::std::os::raw::c_uint,
    pub have_date: ::std::os::raw::c_uint,
    pub have_zone: ::std::os::raw::c_uint,
    pub have_relative: ::std::os::raw::c_uint,
    pub have_weeknr_day: ::std::os::raw::c_uint,
    pub sse_uptodate: ::std::os::raw::c_uint,
    pub tim_uptodate: ::std::os::raw::c_uint,
    pub is_localtime: ::std::os::raw::c_uint,
    pub zone_type: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _timelib_time"][::std::mem::size_of::<_timelib_time>() - 240usize];
    ["Alignment of _timelib_time"][::std::mem::align_of::<_timelib_time>() - 8usize];
    ["Offset of field: _timelib_time::y"][::std::mem::offset_of!(_timelib_time, y) - 0usize];
    ["Offset of field: _timelib_time::m"][::std::mem::offset_of!(_timelib_time, m) - 8usize];
    ["Offset of field: _timelib_time::d"][::std::mem::offset_of!(_timelib_time, d) - 16usize];
    ["Offset of field: _timelib_time::h"][::std::mem::offset_of!(_timelib_time, h) - 24usize];
    ["Offset of field: _timelib_time::i"][::std::mem::offset_of!(_timelib_time, i) - 32usize];
    ["Offset of field: _timelib_time::s"][::std::mem::offset_of!(_timelib_time, s) - 40usize];
    ["Offset of field: _timelib_time::us"][::std::mem::offset_of!(_timelib_time, us) - 48usize];
    ["Offset of field: _timelib_time::z"][::std::mem::offset_of!(_timelib_time, z) - 56usize];
    ["Offset of field: _timelib_time::tz_abbr"]
        [::std::mem::offset_of!(_timelib_time, tz_abbr) - 64usize];
    ["Offset of field: _timelib_time::tz_info"]
        [::std::mem::offset_of!(_timelib_time, tz_info) - 72usize];
    ["Offset of field: _timelib_time::dst"][::std::mem::offset_of!(_timelib_time, dst) - 80usize];
    ["Offset of field: _timelib_time::relative"]
        [::std::mem::offset_of!(_timelib_time, relative) - 88usize];
    ["Offset of field: _timelib_time::sse"][::std::mem::offset_of!(_timelib_time, sse) - 192usize];
    ["Offset of field: _timelib_time::have_time"]
        [::std::mem::offset_of!(_timelib_time, have_time) - 200usize];
    ["Offset of field: _timelib_time::have_date"]
        [::std::mem::offset_of!(_timelib_time, have_date) - 204usize];
    ["Offset of field: _timelib_time::have_zone"]
        [::std::mem::offset_of!(_timelib_time, have_zone) - 208usize];
    ["Offset of field: _timelib_time::have_relative"]
        [::std::mem::offset_of!(_timelib_time, have_relative) - 212usize];
    ["Offset of field: _timelib_time::have_weeknr_day"]
        [::std::mem::offset_of!(_timelib_time, have_weeknr_day) - 216usize];
    ["Offset of field: _timelib_time::sse_uptodate"]
        [::std::mem::offset_of!(_timelib_time, sse_uptodate) - 220usize];
    ["Offset of field: _timelib_time::tim_uptodate"]
        [::std::mem::offset_of!(_timelib_time, tim_uptodate) - 224usize];
    ["Offset of field: _timelib_time::is_localtime"]
        [::std::mem::offset_of!(_timelib_time, is_localtime) - 228usize];
    ["Offset of field: _timelib_time::zone_type"]
        [::std::mem::offset_of!(_timelib_time, zone_type) - 232usize];
};
pub type timelib_time = _timelib_time;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _timelib_error_message {
    pub error_code: ::std::os::raw::c_int,
    pub position: ::std::os::raw::c_int,
    pub character: ::std::os::raw::c_char,
    pub message: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _timelib_error_message"][::std::mem::size_of::<_timelib_error_message>() - 24usize];
    ["Alignment of _timelib_error_message"]
        [::std::mem::align_of::<_timelib_error_message>() - 8usize];
    ["Offset of field: _timelib_error_message::error_code"]
        [::std::mem::offset_of!(_timelib_error_message, error_code) - 0usize];
    ["Offset of field: _timelib_error_message::position"]
        [::std::mem::offset_of!(_timelib_error_message, position) - 4usize];
    ["Offset of field: _timelib_error_message::character"]
        [::std::mem::offset_of!(_timelib_error_message, character) - 8usize];
    ["Offset of field: _timelib_error_message::message"]
        [::std::mem::offset_of!(_timelib_error_message, message) - 16usize];
};
pub type timelib_error_message = _timelib_error_message;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _timelib_error_container {
    pub error_messages: *mut timelib_error_message,
    pub warning_messages: *mut timelib_error_message,
    pub error_count: ::std::os::raw::c_int,
    pub warning_count: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _timelib_error_container"]
        [::std::mem::size_of::<_timelib_error_container>() - 24usize];
    ["Alignment of _timelib_error_container"]
        [::std::mem::align_of::<_timelib_error_container>() - 8usize];
    ["Offset of field: _timelib_error_container::error_messages"]
        [::std::mem::offset_of!(_timelib_error_container, error_messages) - 0usize];
    ["Offset of field: _timelib_error_container::warning_messages"]
        [::std::mem::offset_of!(_timelib_error_container, warning_messages) - 8usize];
    ["Offset of field: _timelib_error_container::error_count"]
        [::std::mem::offset_of!(_timelib_error_container, error_count) - 16usize];
    ["Offset of field: _timelib_error_container::warning_count"]
        [::std::mem::offset_of!(_timelib_error_container, warning_count) - 20usize];
};
pub type timelib_error_container = _timelib_error_container;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _timelib_tzdb_index_entry {
    pub id: *mut ::std::os::raw::c_char,
    pub pos: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _timelib_tzdb_index_entry"]
        [::std::mem::size_of::<_timelib_tzdb_index_entry>() - 16usize];
    ["Alignment of _timelib_tzdb_index_entry"]
        [::std::mem::align_of::<_timelib_tzdb_index_entry>() - 8usize];
    ["Offset of field: _timelib_tzdb_index_entry::id"]
        [::std::mem::offset_of!(_timelib_tzdb_index_entry, id) - 0usize];
    ["Offset of field: _timelib_tzdb_index_entry::pos"]
        [::std::mem::offset_of!(_timelib_tzdb_index_entry, pos) - 8usize];
};
pub type timelib_tzdb_index_entry = _timelib_tzdb_index_entry;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _timelib_tzdb {
    pub version: *const ::std::os::raw::c_char,
    pub index_size: ::std::os::raw::c_int,
    pub index: *const timelib_tzdb_index_entry,
    pub data: *const ::std::os::raw::c_uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _timelib_tzdb"][::std::mem::size_of::<_timelib_tzdb>() - 32usize];
    ["Alignment of _timelib_tzdb"][::std::mem::align_of::<_timelib_tzdb>() - 8usize];
    ["Offset of field: _timelib_tzdb::version"]
        [::std::mem::offset_of!(_timelib_tzdb, version) - 0usize];
    ["Offset of field: _timelib_tzdb::index_size"]
        [::std::mem::offset_of!(_timelib_tzdb, index_size) - 8usize];
    ["Offset of field: _timelib_tzdb::index"]
        [::std::mem::offset_of!(_timelib_tzdb, index) - 16usize];
    ["Offset of field: _timelib_tzdb::data"][::std::mem::offset_of!(_timelib_tzdb, data) - 24usize];
};
pub type timelib_tzdb = _timelib_tzdb;
pub type timelib_tz_get_wrapper = ::std::option::Option<
    unsafe extern "C" fn(
        tzname: *const ::std::os::raw::c_char,
        tzdb: *const timelib_tzdb,
        error_code: *mut ::std::os::raw::c_int,
    ) -> *mut timelib_tzinfo,
>;
unsafe extern "C" {
    pub fn timelib_strtotime(
        s: *const ::std::os::raw::c_char,
        len: usize,
        errors: *mut *mut timelib_error_container,
        tzdb: *const timelib_tzdb,
        tz_get_wrapper: timelib_tz_get_wrapper,
    ) -> *mut timelib_time;
}
unsafe extern "C" {
    pub fn timelib_fill_holes(
        parsed: *mut timelib_time,
        now: *mut timelib_time,
        options: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    #[doc = " Uses the y/m/d/h/i/s fields to calculate and store the equivalent timestamp\n in the sse field.\n\n It uses the time zone information associated with 'time' to account for the\n right UTC offset and/or DST rules. You can associate time zone information\n with the timelib_set_timezone_* functions (see below).\n\n If the type is 'TIMELIB_ZONETYPE_ID' and there is no associated tzinfo, it\n will use the second argument 'tzi' to provide the rules necessary to\n calculate the right timestamp."]
    pub fn timelib_update_ts(time: *mut timelib_time, tzi: *mut timelib_tzinfo);
}
unsafe extern "C" {
    #[doc = " Takes the Unix timestamp from 'ts', and calculates the y/m/d/h/i/s fields\n according to the time zone information attached to 'tm'."]
    pub fn timelib_unixtime2local(tm: *mut timelib_time, ts: timelib_sll);
}
unsafe extern "C" {
    #[doc = " Converts the binary stored time zone information from 'tzdb' for the time\n zone 'timezone' into a structure the library can use for calculations.\n\n The function can be used on both timelib_builtin_db as well as a time zone\n db as opened by timelib_zoneinfo.\n\n 'error_code' must not be a null pointer, and will always be written to. If\n the value is TIMELIB_ERROR_NO_ERROR then the file was parsed without\n problems.\n\n The function will return null upon failure, and also set an error code\n through 'error_code'.\n\n The error code is one of the TIMELIB_ERROR_* constants as listed above.\n These error constants can be converted into a string by\n timelib_get_error_message.\n\n If the function returns not-null, the 'error_code' might have a non-null\n value that can be used to detect incompatibilities. The only one that is\n currently detected is whether the file is a 'slim' file, in which case\n 'error_code' will be set to TIMELIB_ERROR_SLIM_FILE.\n\n This function allocates memory for the new time zone structure, which must\n be freed after use. Although it is recommended that a cache of each used\n time zone is kept."]
    pub fn timelib_parse_tzfile(
        timezone: *const ::std::os::raw::c_char,
        tzdb: *const timelib_tzdb,
        error_code: *mut ::std::os::raw::c_int,
    ) -> *mut timelib_tzinfo;
}
unsafe extern "C" {
    #[doc = " Frees up the resources allocated by 'timelib_parse_tzfile'."]
    pub fn timelib_tzinfo_dtor(tz: *mut timelib_tzinfo);
}
unsafe extern "C" {
    #[doc = " Returns a pointer to the built-in time zone database.\n\n You must *not* free the returned pointer as it is part of the text segment."]
    pub fn timelib_builtin_db() -> *const timelib_tzdb;
}
unsafe extern "C" {
    #[doc = " Allocates resources for the time structure.\n\n Must be freed with 'timelib_time_dtor'."]
    pub fn timelib_time_ctor() -> *mut timelib_time;
}
unsafe extern "C" {
    #[doc = " Frees up the resources as allocated through 'timelib_time_ctor'."]
    pub fn timelib_time_dtor(t: *mut timelib_time);
}
unsafe extern "C" {
    #[doc = " Frees up the resources allocated while converting strings to timelib_time\n structures with the timelib_strtotime and timelib_strtointerval functions."]
    pub fn timelib_error_container_dtor(errors: *mut timelib_error_container);
}
unsafe extern "C" {
    #[doc = " A function that creates timelib_tzinfos if they don't exist and caches them in memory."]
    pub fn timelib_tz_get_wrapper_cached(
        tzname: *const ::std::os::raw::c_char,
        tzdb: *const timelib_tzdb,
        error_code: *mut ::std::os::raw::c_int,
    ) -> *mut timelib_tzinfo;
}
